---
type: ThinLinesOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# ThinLinesOptions

`Autodesk.Revit.UI.ThinLinesOptions` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AreThinLinesEnabled | 2015 Subscription Update | `public static bool AreThinLinesEnabled { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |